Пустыня Черепов простирается по всему ландшафту как пустынное и неумолимое пространство, ее засушливые равнины перемежаются холмистыми дюнами из мелкого зыбучего песка. Неумолимое солнце палит на пересохшую землю, создавая мерцающий мираж, танцующий на горизонте. Воздух пропитан гнетущей жарой, а земля кажется почти лишенной жизни.

Разбросанные остатки древних руин намекают на то, что эта пустыня не была бесплодной пустошью. Однако теперь скелетные останки давно забытых сооружений поднимаются из песка, как призрачные стражи, свидетельство сурового течения времени.

В самом сердце этого запустения находится северный город-оазис Эрроухейвен. Желанная передышка среди суровости, Эрроухейвен — это бастион жизни, поддерживаемый скрытым источником. Пальмы мягко покачиваются на ветру, а скопления яркой зелени резко контрастируют с окружающей пустыней.

Город — скромный, но жизненно важный центр для путешественников, бросающих вызов коварной Пустыне Черепов. Его архитектура отражает одновременно практичность и устойчивость: глинобитные конструкции обеспечивают защиту от палящего солнца. Узкие переулки вьются по городу, предлагая тень и спасение от изнуряющей жары.

Жители Эрроухейвена выносливы и находчивы, приспособившись к жизни в такой негостеприимной среде. Оазис служит жизненно важным источником воды, и горожане научились собирать его дары для пропитания.

Несмотря на суровые условия, Эрроухейвен служит важным маршрутом для искателей приключений, торговцев и кочевников, путешествующих по пустыне. Его существование является свидетельством стойкости тех, кто называет его своим домом, а город-оазис стоит маяком жизни среди обширной, скелетной пустоши Пустыни Черепов.