Η έρημος των κρανίων απλώνεται σε όλο το τοπίο ως μια έρημη και ασυγχώρητη έκταση, με τις άνυδρες πεδιάδες της που στίβονται από κυματιστούς αμμόλοφους λεπτής, κινούμενης άμμου. Ο αδυσώπητος ήλιος χτυπά κάτω στο ξερό έδαφος, δημιουργώντας έναν αστραφτερό αντικατοπτρισμό που χορεύει στον ορίζοντα. Ο αέρας είναι πυκνός από την καταπιεστική ζέστη και η γη φαίνεται σχεδόν στερημένη από ζωή.

Διάσπαρτα απομεινάρια αρχαίων ερειπίων υπαινίσσονται μια εποχή που αυτή η έρημος δεν ήταν μια άγονη ερημιά. Τώρα, ωστόσο, τα σκελετικά υπολείμματα ξεχασμένων κατασκευών υψώνονται από την άμμο σαν απόκοσμοι φρουροί, μια απόδειξη για το σκληρό πέρασμα του χρόνου.

Στην καρδιά αυτής της ερήμωσης βρίσκεται η βόρεια πόλη όαση Arrowhaven. Μια ευπρόσδεκτη ανάπαυλα μέσα στη σκληρότητα, το Arrowhaven είναι ένα προπύργιο ζωής που συντηρείται από ένα κρυμμένο πηγάδι. Οι φοίνικες ταλαντεύονται απαλά στο αεράκι και οι συστάδες ζωντανής πρασινάδας προσφέρουν μια έντονη αντίθεση με τη γύρω έρημο.

Η πόλη είναι ένας μέτριος αλλά ζωτικής σημασίας κόμβος για τους ταξιδιώτες που παλεύουν με την ύπουλη έρημο των κρανίων. Η αρχιτεκτονική του αντανακλά τόσο την πρακτικότητα όσο και την ανθεκτικότητα, με τις πλίθινα κατασκευές να παρέχουν καταφύγιο στον ανελέητο ήλιο. Τα στενά σοκάκια διασχίζουν την πόλη, προσφέροντας σκιά και ανακούφιση από την καταπιεστική ζέστη.

Οι κάτοικοι του Arrowhaven είναι ανθεκτικοί και πολυμήχανοι, έχοντας προσαρμοστεί στις προκλήσεις της ζωής σε ένα τόσο αφιλόξενο περιβάλλον. Η όαση χρησιμεύει ως ζωτική πηγή νερού και οι κάτοικοι της πόλης έχουν μάθει να συγκομίζουν τη γενναιοδωρία της για τροφή.

Παρά το σκληρό περιβάλλον του, το Arrowhaven χρησιμεύει ως κρίσιμο σημείο διαδρομής για τυχοδιώκτες, εμπόρους και νομάδες που διασχίζουν την έρημο. Η ύπαρξή του είναι απόδειξη της ανθεκτικότητας όσων το αποκαλούν σπίτι, και η πόλη όαση στέκεται ως φάρος ζωής ανάμεσα στην απέραντη, σκελετική ερημιά της Ερήμου των Κρανίων.