## Симптомы:
Быстрое ухудшение состояния кровеносных сосудов, вызывающее внутреннее кровотечение, тяжелую анемию и недостаточность органов. Отличительной особенностью является потемневшая, почти черная кровь.

## Причины:
Передается через укусы зараженных существ или при контакте с зараженной кровью. Распространен в регионах, где распространена темная магия.

## Лечение:
Магические лечебные заклинания, направленные на очищение крови, могут замедлить прогрессирование. Известно, что экстракты цветка Луносвета, найденные в священных садах, противодействуют этому эффекту.