## Συμπτώματα:
Ταχεία επιδείνωση των αιμοφόρων αγγείων, που προκαλεί εσωτερική αιμορραγία, σοβαρή αναιμία και ανεπάρκεια οργάνων. Το σκοτεινό, σχεδόν μαύρο αίμα είναι ένα ξεχωριστό χαρακτηριστικό.

## Αιτίες:
Μεταδίδεται μέσω των δαγκωμάτων μολυσμένων πλασμάτων ή μέσω της επαφής με μολυσμένο αίμα. Συνηθίζεται σε περιοχές όπου επικρατεί η σκοτεινή μαγεία.

## Θεραπείες:
Τα μαγικά θεραπευτικά ξόρκια που επικεντρώνονται στον καθαρισμό του αίματος μπορούν να επιβραδύνουν την εξέλιξη. Αποσπάσματα από το λουλούδι Silvermoon, που βρίσκονται σε ιερούς κήπους, είναι γνωστό ότι εξουδετερώνουν τις επιπτώσεις.