## Симптомы:
Опухшие, болезненные лимфатические узлы (бубоны), высокая температура, озноб и усталость. В тяжелых случаях это приводит к септицемии и органной недостаточности.

## Причины:
Передается через укусы зараженных блох, которые часто поражают грызунов. Распространен в густонаселенных городских районах и регионах с плохими санитарными условиями.

## Лечение:
Очищающие заклинания могут помочь в борьбе с инфекцией. Считается, что редкая трава звездчатого лепестка, произрастающая в отдаленных горных регионах, обладает мощными антибактериальными свойствами.