## Συμπτώματα:
Πρησμένοι, επώδυνοι λεμφαδένες (buboes), υψηλός πυρετός, ρίγη και κόπωση. Σε σοβαρές περιπτώσεις, οδηγεί σε σηψαιμία και ανεπάρκεια οργάνων.

## Αιτίες:
μεταδίδεται μέσω των τσιμπημάτων μολυσμένων ψύλλων, οι οποίοι συχνά προσβάλλουν τρωκτικά. Συχνά σε πολυσύχναστες αστικές περιοχές και περιοχές με κακή υγιεινή.

## Θεραπείες:
Τα ξόρκια καθαρισμού μπορούν να βοηθήσουν στην καταπολέμηση της μόλυνσης. Το σπάνιο βότανο Starpetal, που βρίσκεται σε απομακρυσμένες ορεινές περιοχές, πιστεύεται ότι έχει ισχυρές αντιβακτηριακές ιδιότητες.