## Симптомы:
У больных людей кожа приобретает болезненный зеленый оттенок, что сопровождается постепенным разложением плоти. Часто наблюдаются утомляемость, слабость и общее недомогание.

## Причины:
Заразился при воздействии определенных грибов, обитающих во влажных пещерах и болотистых местах. Споры, выделяемые грибами, являются основным способом передачи инфекции.

## Лечение:
Опытный целитель может использовать очищающие заклинания, чтобы очистить организм от грибковой инфекции. Редкие травы, найденные в мистических рощах, можно использовать в припарках, способствующих выздоровлению.