## Συμπτώματα:
Τα προσβεβλημένα άτομα βιώνουν μια αρρωστημένη πράσινη απόχρωση στο δέρμα τους, που συνοδεύεται από μια σταδιακή αποσύνθεση της σάρκας. Η κόπωση, η αδυναμία και η γενική αδιαθεσία είναι κοινά.

## Αιτίες:
Συστέλλεται μέσω της έκθεσης σε ορισμένους μύκητες που βρίσκονται σε υγρά σπήλαια και ελώδεις περιοχές. Τα σπόρια που απελευθερώνονται από τους μύκητες είναι ο κύριος τρόπος μετάδοσης.

## Θεραπείες:
Ένας έμπειρος θεραπευτής μπορεί να χρησιμοποιήσει ξόρκια καθαρισμού για να καθαρίσει το σώμα από τη μυκητιασική λοίμωξη. Σπάνια βότανα που βρίσκονται σε μυστικιστικούς ελαιώνες μπορούν να χρησιμοποιηθούν σε καταπλάσματα για να βοηθήσουν στην ανάρρωση.