# Συμπτώματα:
Επίμονος βήχας, δυσκολία στην αναπνοή και ένας θόρυβος κατά την εισπνοή. Τα προσβεβλημένα άτομα υποφέρουν από εξασθενημένη πνευμονική λειτουργία και μπορεί να αναπτύξουν πνευμονία.

## Αιτίες:
Εισπνοή αερομεταφερόμενων σπορίων που απελευθερώνονται από ορισμένα τοξικά φυτά και μύκητες που βρίσκονται σε σκοτεινά δάση. Η έκθεση συχνά οφείλεται σε παρατεταμένη παραμονή σε τέτοια περιβάλλοντα.

## Θεραπείες:
Τα θεραπευτικά ξόρκια που ενισχύουν τις αναπνευστικές λειτουργίες μπορούν να βοηθήσουν στην ανάρρωση. Το σπάνιο βότανο Moonshade, που καλλιεργείται σε συγκεκριμένους αλχημικούς κήπους, είναι γνωστό για την ισχύ του στη θεραπεία παθήσεων που σχετίζονται με τους πνεύμονες.