# Симптомы:
Постоянный кашель, затруднение дыхания и скрежетающий звук при вдохе. Заболевшие люди страдают от ослабления функции легких и могут развить пневмонию.

## Причины:
Вдыхание переносимых по воздуху спор, выделяемых некоторыми токсичными растениями и грибами, обитающими в темных лесах. Воздействие часто происходит из-за длительного пребывания в таких условиях.

## Лечение:
Исцеляющие заклинания, укрепляющие дыхательные функции, могут помочь выздоровлению. Редкая трава лунной тени, выращиваемая в определенных алхимических садах, известна своей эффективностью при лечении заболеваний легких.